cf_billing/Documents/бестЗагруженныеДанныеИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестЗагруженныеДанныеИзВнешнихИсточников</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредоставленныеОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Час</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗагруженныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГотовКОбработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьКоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗонаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШкалаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГотовКОбработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестВидыДифференцированностиПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестВидыДифференцированностиПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестПочасоваяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестПочасоваяВедомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестДанныеПочасовойВедомости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестЗагруженныеДанныеИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредоставленныеОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Час</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестЗагруженныеДанныеИзВнешнихИсточников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

	Процедура СоздатьРегистрацииПоказаний(ДокументЗагрузки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бестЗагруженныеДанныеИзВнешнихИсточников.Показания КАК бестЗагруженныеДанныеИзВнешнихИсточниковПоказания
	|ГДЕ
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Ссылка = &Ссылка
	|	И (бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ПриборУчета = ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.пустаяссылка)
	|			ИЛИ бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ТочкаУчета = ЗНАЧЕНИЕ(Справочник.энргТочкиУчета.пустаяссылка)
	|			ИЛИ бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ОбъектРасчета = ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.пустаяссылка)
	|			ИЛИ бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Шкала = ЗНАЧЕНИЕ(Справочник.энргШкалыПриборовУчета.пустаяссылка)
	|			ИЛИ бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ТарифнаяЗона = ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.пустаяссылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРегистрацияПоказанийНП.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бестРегистрацияПоказанийНП КАК бестРегистрацияПоказанийНП
	|ГДЕ
	|	бестРегистрацияПоказанийНП.ДокументОснование = &Ссылка
	|	И НЕ бестРегистрацияПоказанийНП.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументЗагрузки);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	Если НЕ Пакеты[0].Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В документе остались незагруженные данные. Создание регистраций показаний невозможно.");
		Возврат;
	КонецЕсли;
	
	Если НЕ Пакеты[1].Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Регистрации показаний уже созданы.");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Организация КАК Организация,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Район КАК Район,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ПериодНачисления КАК ПериодНачисления,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ПриборУчета КАК ПриборУчета,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ТочкаУчета КАК ТочкаУчета,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ОбъектРасчета КАК ОбъектРасчета,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ТарифнаяЗона КАК ТарифнаяЗона,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Шкала КАК Шкала,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Показания КАК ТекущиеПоказания,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Услуга КАК Услуга,
	|	бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка КАК ДокументОснование,
	|	бестЗагруженныеДанныеИзВнешнихИсточников.Дата КАК Дата,
	|	бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ВидДифференцированности КАК ВидДифференцированности
	|ИЗ
	|	Документ.бестЗагруженныеДанныеИзВнешнихИсточников.Показания КАК бестЗагруженныеДанныеИзВнешнихИсточниковПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗагруженныеДанныеИзВнешнихИсточников КАК бестЗагруженныеДанныеИзВнешнихИсточников
	|		ПО бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Ссылка = бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестВидыДифференцированностиПриборовУчетаНП.СрезПоследних(&Период, ) КАК бестВидыДифференцированностиПриборовУчетаНПСрезПоследних
	|		ПО бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ТочкаУчета = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ТочкаУчета
	|			И бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.ПриборУчета = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.ПриборУчета
	|			И бестЗагруженныеДанныеИзВнешнихИсточниковПоказания.Шкала = бестВидыДифференцированностиПриборовУчетаНПСрезПоследних.Шкала
	|ГДЕ
	|	бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектРасчета,
	|	ТочкаУчета,
	|	ПриборУчета,
	|	Шкала
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Район),
	|	МАКСИМУМ(ПериодНачисления),
	|	МАКСИМУМ(ДокументОснование),
	|	МАКСИМУМ(Дата)
	|ПО
	|	ОбъектРасчета";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументЗагрузки);
	Запрос.УстановитьПараметр("Период", ДокументЗагрузки.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбъектРасчета = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Отказ = Ложь;
	МассивДокументов = Новый Массив;
	
	Пока ВыборкаОбъектРасчета.Следующий() Цикл
		Попытка
			РегистрацияПоказаний = Документы.бестРегистрацияПоказанийНП.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(РегистрацияПоказаний, ВыборкаОбъектРасчета);
			РегистрацияПоказаний.ВидОперации = Перечисления.бестВидыОпераций.бестРегистрацияПоказанийНП_РегистрацияПоказаний;
			Выборка = ВыборкаОбъектРасчета.Выбрать();
			
			ТекТочкаУчета 								= Неопределено;
			ТекПрибор 									= Неопределено;
			ТекШкала 									= Неопределено;
			IDСтрокиТочки 								= Неопределено;
			IDСтрокиШкалы 								= Неопределено;
			Пока Выборка.Следующий() Цикл
				Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или Не ТекПрибор = Выборка.ПриборУчета Тогда
					СтрокаТочкиУчета  					= РегистрацияПоказаний.ТочкиУчета.Добавить();
					IDСтрокиТочки 						= Новый УникальныйИдентификатор;
					ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
					СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
				КонецЕсли;
				
				Если НЕ ТекШкала = Выборка.Шкала ИЛИ ТекТочкаУчета <> Выборка.ТочкаУчета Тогда
					СтрокаШкалы  						= РегистрацияПоказаний.ШкалыПриборовУчета.Добавить();
					IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
					СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
					СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
					СтрокаШкалы.Шкала 					= Выборка.Шкала;
					СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
				КонецЕсли;
				
				СтрокаПоказаний 						= РегистрацияПоказаний.ПоказанияПриборовУчета.Добавить();
				СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
				СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
				СтрокаПоказаний.ТекущиеПоказания		= Выборка.ТекущиеПоказания;
				
				ТекТочкаУчета 							= Выборка.ТочкаУчета;
				ТекПрибор 								= Выборка.ПриборУчета;
				ТекШкала 								= Выборка.Шкала;
			КонецЦикла;
			
			бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(РегистрацияПоказаний.ТочкиУчета,РегистрацияПоказаний.ШкалыПриборовУчета,РегистрацияПоказаний.ПоказанияПриборовУчета,РегистрацияПоказаний.Дата,РегистрацияПоказаний.Организация,РегистрацияПоказаний.Район,Ложь);
			
			ПоказанияПриборов = РегистрацияПоказаний.ПоказанияПриборовУчета;
			бестРаботаСПоказаниямиПриборовУчетаНПСервер.ПроверитьОшибкуПрофиля(ПоказанияПриборов);
			бестРаботаСПоказаниямиПриборовУчетаНПСервер.КонтрольОшибкиДругойЗоны(ПоказанияПриборов);
			
			МассивДокументов.Добавить(РегистрацияПоказаний);
			
			РегистрацияПоказаний.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			Отказ = Истина;  			
			Инфо = ИнформацияОбОшибке();
			Прервать;
			
		КонецПопытки;
	КонецЦикла; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для Каждого ТекДокумент Из МассивДокументов Цикл  
		Попытка
			ТекДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение 
			Отказ = Истина;  			
			Инфо = ИнформацияОбОшибке();
            Прервать;
		КонецПопытки;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документы созданы.");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьПочасовыеВедомости(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестЗагруженныеДанныеИзВнешнихИсточников.ФайлДляЧтения КАК ФайлДляЧтения,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.ПриборУчета КАК ПриборУчета,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.ТочкаУчета КАК ТочкаУчета,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.IDСтроки КАК IDСтроки,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПредоставленныеОбъемы.День КАК День,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПредоставленныеОбъемы.Час КАК Час,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковПредоставленныеОбъемы.Объем КАК Объем,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.Организация КАК Организация,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.Район КАК Район,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.ОбъектРасчета КАК ОбъектРасчета,
	|	ВЫБОР
	|		КОГДА бестПочасоваяВедомость.ПометкаУдаления
	|			ТОГДА NULL
	|		ИНАЧЕ бестПочасоваяВедомость.Ссылка
	|	КОНЕЦ КАК ПочасоваяВедомость,
	|	бестЗагруженныеДанныеИзВнешнихИсточников.ДатаФактическогоСобытия КАК ДатаФактическогоСобытия,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.ВидОперации КАК ВидОперации,
	|	бестЗагруженныеДанныеИзВнешнихИсточников.Дата КАК Дата,
	|	бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.УчитыватьКоэффициентПУ КАК УчитыватьКоэффициентПУ
	|ИЗ
	|	Документ.бестЗагруженныеДанныеИзВнешнихИсточников КАК бестЗагруженныеДанныеИзВнешнихИсточников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗагруженныеДанныеИзВнешнихИсточников.ЗагруженныеДанные КАК бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестЗагруженныеДанныеИзВнешнихИсточников.ПредоставленныеОбъемы КАК бестЗагруженныеДанныеИзВнешнихИсточниковПредоставленныеОбъемы
	|			ПО бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.Ссылка = бестЗагруженныеДанныеИзВнешнихИсточниковПредоставленныеОбъемы.Ссылка
	|				И бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.IDСтроки = бестЗагруженныеДанныеИзВнешнихИсточниковПредоставленныеОбъемы.IDСтроки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПочасоваяВедомость КАК бестПочасоваяВедомость
	|			ПО бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.Ссылка = бестПочасоваяВедомость.ДокументОснование
	|				И бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.ОбъектРасчета = бестПочасоваяВедомость.ОбъектРасчета
	|				И бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.ТочкаУчета = бестПочасоваяВедомость.ТочкаУчета
	|				И бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.ПриборУчета = бестПочасоваяВедомость.ПриборУчета
	|		ПО бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка = бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.Ссылка
	|ГДЕ
	|	бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка = &Ссылка
	|	И бестЗагруженныеДанныеИзВнешнихИсточниковЗагруженныеДанные.ГотовКОбработке
	|ИТОГИ
	|	МАКСИМУМ(ФайлДляЧтения),
	|	МАКСИМУМ(ПриборУчета),
	|	МАКСИМУМ(ТочкаУчета),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Район),
	|	МАКСИМУМ(ОбъектРасчета),
	|	МАКСИМУМ(ПочасоваяВедомость),
	|	МАКСИМУМ(ДатаФактическогоСобытия),
	|	МАКСИМУМ(ВидОперации),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(УчитыватьКоэффициентПУ)
	|ПО
	|	IDСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыборкаIDСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НачатьТранзакцию();
	Попытка	
		Пока ВыборкаIDСтроки.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаIDСтроки.ПочасоваяВедомость) Тогда
				ПочасоваяВедомостьОбъект = ВыборкаIDСтроки.ПочасоваяВедомость.ПолучитьОбъект();
				ПочасоваяВедомостьОбъект.ПредоставленныеОбъемы.Очистить();
			Иначе
				ПочасоваяВедомостьОбъект = Документы.бестПочасоваяВедомость.СоздатьДокумент();
				ПочасоваяВедомостьОбъект.ДокументОснование = Ссылка;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ПочасоваяВедомостьОбъект, ВыборкаIDСтроки);
			ПочасоваяВедомостьОбъект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Ссылка.Дата, ПочасоваяВедомостьОбъект.Организация,ПочасоваяВедомостьОбъект.Район);
				
			ВыборкаДетальныеЗаписи = ВыборкаIDСтроки.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НовСтр = ПочасоваяВедомостьОбъект.ПредоставленныеОбъемы.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
			КонецЦикла;
			
			ПочасоваяВедомостьОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		Возврат Истина;
	Исключение
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
КонецФункции

#КонецОбласти

#КонецЕсли
